Can you let me know what error u r facing after setting the region to jp-tok
```
Harinis-MacBook-Pro:dynamic hkantare$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.ibm_resource_group.rg: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_is_subnet.k8s_cluster_snet[0] will be created
  + resource "ibm_is_subnet" "k8s_cluster_snet" {
      + available_ipv4_address_count = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.155.1.0/24"
      + ipv6_cidr_block              = (known after apply)
      + name                         = "div-cloud-mgmt-test-dev-k8s-snet1"
      + network_acl                  = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + status                       = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "jp-tok-1"
    }

  # ibm_is_subnet.k8s_cluster_snet[1] will be created
  + resource "ibm_is_subnet" "k8s_cluster_snet" {
      + available_ipv4_address_count = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.155.2.0/24"
      + ipv6_cidr_block              = (known after apply)
      + name                         = "div-cloud-mgmt-test-dev-k8s-snet2"
      + network_acl                  = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + status                       = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "jp-tok-2"
    }

  # ibm_is_vpc.k8s_vpc will be created
  + resource "ibm_is_vpc" "k8s_vpc" {
      + address_prefix_management = "manual"
      + classic_access            = false
      + crn                       = (known after apply)
      + cse_source_addresses      = (known after apply)
      + default_network_acl       = (known after apply)
      + default_security_group    = (known after apply)
      + id                        = (known after apply)
      + name                      = "div-cloud-mgmt-test-dev-k8s-vpc"
      + resource_controller_url   = (known after apply)
      + resource_crn              = (known after apply)
      + resource_group            = "a7a89ca48da04fb991a4ae687ed332a8"
      + resource_group_name       = (known after apply)
      + resource_name             = (known after apply)
      + resource_status           = (known after apply)
      + status                    = (known after apply)
      + subnets                   = (known after apply)
      + tags                      = (known after apply)
    }

  # ibm_is_vpc_address_prefix.cluster_vpc_address_prefix will be created
  + resource "ibm_is_vpc_address_prefix" "cluster_vpc_address_prefix" {
      + cidr        = "10.155.0.0/16"
      + has_subnets = (known after apply)
      + id          = (known after apply)
      + name        = "div-cloud-mgmt-test-dev-k8s-vpc-prefix"
      + vpc         = (known after apply)
      + zone        = "jp-tok-1"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

From the plan you can see the  + zone                         = "jp-tok-1" and + zone                         = "jp-tok-2"  Its able to read the zones from the list